from django.urls import path
from store.views import index, about, product_list, products_json, product_details, add_product


app_name = "store"

# ყველა ენდფოინთი urls.py გაწერის ნაცვლად უმჯობესია თითოეულ აპლიკაციას შიგნითვე შევუქმნათ urls ფაილი
# და ამავე ფაილში გავუწეროთ ეს ენდფოინთები,
# ხოლო ამ ენდფოინთების ასამუშავებლად კი includesს გამოყენებით წავიღოთ urls.py ფაილში
# ამ მიდგომით თითოეული ენდფოინთი იქნება აპლიკაციაში და მათ გამოსაძახებლად
#ი pathში ჯერ უნდა შევიდეთ აპლიკაციაში შემდეგ კი შევიდეთ ამ ენდფოინთებზე

urlpatterns = [
    path('', index, name='index'),
    # თუკი routeს ცარიელს დავტოვებთ, მაშინ ენდფოინთის გამოძახების გარეშე გაეშვება ეს გვერდი
    # მარგამ მხოლოდ ერთხელ შეგვიძლია ენდფოინთის ცარეილი დატოვება
    path('about/', about, name='about'),
    path('products.json/', products_json, name='products_json'),
    path('products/', product_list, name='product_list'),
    path('products/<int:product_pk>/', product_details, name='product_details'),
    path('add_product/', add_product, name='add_product'),




# რადგანაც მეორე პარამეტრიც გადავეცით ფუნქციას, routeში ახალი path უნდა შევუქმნათ, აქ შემოდის ის რითიც უნდა დავიჭიროთ id,
# თუკი მონაცემთა ბაზიდან წამოვა id 3, მაშინ აქ უნდა დაიჭიროს 3იანი, რის შემდეგაც გამოიტანს იმ მონაცემს რომლის ID იქნება 3

# ენდფოინთის შემქნის შემდეგ ინდა დავუწვას / დახრილი ხაზი და <> მეტობა ნაკლებობის ნიშანში უნდა გავუწეროთ
# 1: მონაცემი ტიპი, რა მონაცემის ტიპი უნდა შემოვიდეს
# 2: უშუალოდ ჩვენს მიერ ფუქნციაში გადაცემულ პარამეტრი, რათა ეს პარამეტრი დაიჭიროს, როცა ამ პარამეტრს დაიჭერს,
# ფუქნციაში ეს მონაცემი გაუტოლდება ID ის და ამ აიდით წამოიღებს მონაცემს რომელიც დაგვიბრუნდება ვიზუალურად
# მაგრამ იმ შემთხვევაშ თუკი ID არ არსებობს საიტი გავა ერორზე, იმისათვის რომ ერორზე არ გავიდეს, ვიყენებთ get_object_404, თუ პროდუქტი იქნება დააბრუნებს ამ პროდუქტს
# ხოლო თუ არ იქნება მაშინ გამოიტანს რომ პროდუქტი არ არსებობს / ეს get_object_404 უნდა დავაიმპორტოთ და გამოვიყენოთ ფუქნციაშივე >>>
]



# ფუნქციის შემდეგ გაწერილ nameებს ვიყენებთ იმისათვის რომ html დოკუმენტეი დავაკავშიროთ ერთმანეთს, nameში გაწერილ სახელებს კი ამ კავშირისატვის ვიყენებთ
# ეს კავშირი კი უშუალოდ html დოკუმენტში უნდა შევქმნათ, რისთვისაც ვიყენებთ jinja2 ის ენას
# a href თეგით უნდა დავაკავშიროთ, ხოლო jinjas ენით კუ უნდა შევქმნათ დამაკავშირებელი ლინკი
# {% url 'store:about' %}
# ფიგურულ ფრჩხილებში უნდა დავუწეროთ პროცემტის ნიშანი {% %} შიგნით კი უნდა ავაგოთ url,
# ჯერ უნდა დავუწეროთ url და შემდეგ კი აპლიკაციის დასახელება და ის სახელი რომელიც pathში გავუწერეთ nameში